In [2]:
import pandas as pd

from sklearn.preprocessing import LabelEncoder


df=pd.read_csv("sample_data.csv")

df.head()

     Name  Gender       City Passed
0    Aman    Male      Delhi    Yes
1   Priya  Female     Mumbai    Yes
2   Rahul    Male  Bangalore     No
3  Anjali  Female     Mumbai    Yes
4    Ravi    Male      Delhi    Yes

In [4]:
df_label=df.copy()
df_label

      Name  Gender       City Passed
0     Aman    Male      Delhi    Yes
1    Priya  Female     Mumbai    Yes
2    Rahul    Male  Bangalore     No
3   Anjali  Female     Mumbai    Yes
4     Ravi    Male      Delhi    Yes
5    Meera  Female    Chennai     No
6    Arjun    Male  Bangalore    Yes
7     Neha  Female      Delhi    Yes
8    Imran    Male    Chennai     No
9    Sneha  Female     Mumbai    Yes
10     Raj    Male    Chennai    Yes
11   Divya  Female      Delhi     No
12   Kabir    Male     Mumbai    Yes
13  Simran  Female  Bangalore    Yes
14   Karan    Male      Delhi     No
15   Pooja  Female     Mumbai    Yes
16  Rakesh    Male    Chennai    Yes
17    Isha  Female      Delhi     No
18   Rohit    Male      Delhi    Yes
19   Deepa  Female  Bangalore    Yes

In [10]:
df_label = df.copy()
le = LabelEncoder()

df_label["Label_gender"] = le.fit_transform(df_label["Gender"])
df_label["Label_Passed"] = le.fit_transform(df_label["Passed"])

print(df_label[["Gender","Passed","Label_gender","Label_Passed"]])

    Gender Passed  Label_gender  Label_Passed
0     Male    Yes             1             1
1   Female    Yes             0             1
2     Male     No             1             0
3   Female    Yes             0             1
4     Male    Yes             1             1
5   Female     No             0             0
6     Male    Yes             1             1
7   Female    Yes             0             1
8     Male     No             1             0
9   Female    Yes             0             1
10    Male    Yes             1             1
11  Female     No             0             0
12    Male    Yes             1             1
13  Female    Yes             0             1
14    Male     No             1             0
15  Female    Yes             0             1
16    Male    Yes             1             1
17  Female     No             0             0
18    Male    Yes             1             1
19  Female    Yes             0             1

In [13]:
df_encoded=pd.get_dummies(df,columns=["City"])

print(df_encoded)

      Name  Gender Passed  Label_gender  Label_Passes  Label_Passed  \
0     Aman    Male    Yes             1             1             1
1    Priya  Female    Yes             0             1             1
2    Rahul    Male     No             1             0             0
3   Anjali  Female    Yes             0             1             1
4     Ravi    Male    Yes             1             1             1
5    Meera  Female     No             0             0             0
6    Arjun    Male    Yes             1             1             1
7     Neha  Female    Yes             0             1             1
8    Imran    Male     No             1             0             0
9    Sneha  Female    Yes             0             1             1
10     Raj    Male    Yes             1             1             1
11   Divya  Female     No             0             0             0
12   Kabir    Male    Yes             1             1             1
13  Simran  Female    Yes             0             1             1
14   Karan    Male     No             1             0             0
15   Pooja  Female    Yes             0             1             1
16  Rakesh    Male    Yes             1             1             1
17    Isha  Female     No             0             0             0
18   Rohit    Male    Yes             1             1             1
19   Deepa  Female    Yes             0             1             1

    City_Bangalore  City_Chennai  City_Delhi  City_Mumbai
0            False         False        True        False
1            False         False       False         True
2             True         False       False        False
3            False         False       False         True
4            False         False        True        False
5            False          True       False        False
6             True         False       False        False
7            False         False        True        False
8            False          True       False        False
9            False         False       False         True
10           False          True       False        False
11           False         False        True        False
12           False         False       False         True
13            True         False       False        False
14           False         False        True        False
15           False         False       False         True
16           False          True       False        False
17           False         False        True        False
18           False         False        True        False
19            True         False       False        False

In [14]:
df_encoded.head()

,Name,Gender,Passed,Label_gender,Label_Passes,Label_Passed,City_Bangalore,City_Chennai,City_Delhi,City_Mumbai
0,Aman,Male,Yes,1,1,1,False,False,True,False
1,Priya,Female,Yes,0,1,1,False,False,False,True
2,Rahul,Male,No,1,0,0,True,False,False,False
3,Anjali,Female,Yes,0,1,1,False,False,False,True
4,Ravi,Male,Yes,1,1,1,False,False,True,False

In [17]:
df_encoded["City_Bangalore"].dtypes

dtype('bool')

In [18]:
df_encoded["City_Bangalore"]=le.fit_transform(df_encoded["City_Bangalore"])

In [19]:
df_encoded.head()

,Name,Gender,Passed,Label_gender,Label_Passes,Label_Passed,City_Bangalore,City_Chennai,City_Delhi,City_Mumbai
0,Aman,Male,Yes,1,1,1,0,False,True,False
1,Priya,Female,Yes,0,1,1,0,False,False,True
2,Rahul,Male,No,1,0,0,1,False,False,False
3,Anjali,Female,Yes,0,1,1,0,False,False,True
4,Ravi,Male,Yes,1,1,1,0,False,True,False

In [21]:
from sklearn.preprocessing import StandardScaler
import pandas as pd

df = pd.DataFrame({"Marks":[40,50,60,70,80]})

sc = StandardScaler()
df["Standard"] = sc.fit_transform(df[["Marks"]])
df

   Marks  Standard
0     40 -1.414214
1     50 -0.707107
2     60  0.000000
3     70  0.707107
4     80  1.414214